gab-k/FlexAudioLink/STM32_SW/Appli/Core/Src/audio.c
  // if (data_read_count != sizeof(spk_buf)/2) {
  //   Error_Handler();
  // }
  
}

void audio_control_task(void) {
  // Press on-board button to control volume
  // Open host volume control, volume should switch between 10% and 100%

  // Poll every 50ms
  const uint32_t interval_ms = 50;
  static uint32_t start_ms = 0;
  static uint32_t btn_prev = 0;

  if (HAL_GetTick() - start_ms < interval_ms) return;// not enough time
  start_ms += interval_ms;

  uint32_t btn = BSP_PB_GetState(BUTTON_USER);

  // Even UAC1 spec have status interrupt support like UAC2, most host do not support it
  // So you have to either use UAC2 or use old day HID volume control
  TU_VERIFY((tud_audio_version() == 1),);

  if (!btn_prev && btn) {
    // Adjust volume between 0dB (100%) and -30dB (10%)
    for (int i = 0; i < CFG_TUD_AUDIO_FUNC_1_N_CHANNELS_RX + 1; i++) {
      volume[i] = volume[i] == 0 ? -VOLUME_CTRL_30_DB : 0;
    }

    // 6.1 Interrupt Data Message
    const audio_interrupt_data_t data = {.v2 = {
        .bInfo = 0,                                      // Class-specific interrupt, originated from an interface
        .bAttribute = AUDIO20_CS_REQ_CUR,                // Caused by current settings
        .wValue_cn_or_mcn = 0,                           // CH0: master volume
        .wValue_cs = AUDIO20_FU_CTRL_VOLUME,             // Volume change
        .wIndex_ep_or_int = 0,                           // From the interface itself
        .wIndex_entity_id = UAC2_ENTITY_SPK_FEATURE_UNIT,// From feature unit
    }};

    tud_audio_int_write(&data);
  }

  btn_prev = btn;
}


void audio_init() {
  // Fill the entire buffer with silence to start cleanly
  init_test_sawtooth();

  // Start the DMA ONCE in circular mode. It will run forever.
  HAL_StatusTypeDef status = HAL_I2SEx_TransmitReceive_DMA(&hi2s2, (uint16_t*)spk_buf, (uint16_t*) mic_buf, sizeof(spk_buf)/sizeof(spk_buf[0]));
  if (status != HAL_OK)
  {
    Error_Handler();
  }
}

  

void init_test_sine_array() {
  // Desired Frequency
  float frequency = 12000.0f; // 12 kHz
  // Sampling Rate
  float sample_rate = 48000.0f; // 48 kHz
  // Calculate the angle step for each sample to generate the desired frequency.
  double angle_step = 2.0 * M_PI * frequency / sample_rate;
    // Iterate through the buffer and fill it with sine data.
  // We step by 2 because we are filling a stereo buffer (Left and Right channels).
  for (unsigned int i = 0; i < sizeof(spk_buf)/sizeof(spk_buf[0]); i += 2) {
    // Calculate the sine value for the current sample position.
    // The sample index 'n' is i/2 because we handle L/R pairs.
    int n = i / 2;
    double sin_value = sin((double)n * angle_step);

    // Scale the sine value by the amplitude and cast to a 16-bit integer.
    int16_t sample_value = (int16_t)(28000 * sin_value);

    // Place the same sample in both Left and Right channels.
    spk_buf[i]     = sample_value; // Left Channel
    spk_buf[i + 1] = sample_value; // Right Channel
  }
  // Clean the specific memory region of the buffer from the D-Cache
  //SCB_CleanDCache_by_Addr((uint32_t*)test_spk_buf, sizeof(test_spk_buf));
}


void init_test_sawtooth() {
  // --- Configuration ---
  const int16_t amplitude = 28000;
  const unsigned int total_samples = sizeof(spk_buf) / sizeof(spk_buf[0]);
  
  // The number of L/R sample pairs in the buffer.
  const unsigned int num_stereo_samples = total_samples / 2;

  // --- Generate the Sawtooth Wave ---
  for (unsigned int i = 0; i < num_stereo_samples; i++) {
    // Calculate the value for the current sample.
    // This creates a linear ramp from -amplitude to +amplitude.
    double normalized_position = (double)i / (num_stereo_samples - 1); // Goes from 0.0 to 1.0
    int16_t sample_value = (int16_t)(-amplitude + (2.0 * amplitude * normalized_position));

    // Place the same sample in both Left and Right channels.
    spk_buf[i * 2]     = sample_value; // Left Channel
    spk_buf[i * 2 + 1] = sample_value; // Right Channel
  }
  
  // Clean the D-Cache once after modifying the entire buffer.
  //SCB_CleanDCache_by_Addr((uint32_t*)test_spk_buf, sizeof(test_spk_buf));
}

//--------------------------------------------------------------------+
// DMA Callbacks
//--------------------------------------------------------------------+

void I2S_DMA_TX_HalfCpltCallback(DMA_HandleTypeDef *hdma)
{
  UNUSED(hdma);
  HAL_GPIO_WritePin(LED_YELLOW_GPIO_Port, LED_YELLOW_Pin, GPIO_PIN_RESET);
  i2s_dma_buffer_half_to_fill = 0;
  // if (i2s_dma_buffer_half_to_fill != -1) {
  //   // We are late, the main loop has not yet processed the previous half
  //   HAL_GPIO_WritePin(LED_RED_GPIO_Port, LED_RED_Pin, GPIO_PIN_SET);
  //   //Error_Handler();
  // }
  // else {
  //   // First half of buffer consumed, signal main loop to fill it
  //   i2s_dma_buffer_half_to_fill = 0;
  // }
}

void I2S_DMA_TX_CpltCallback(DMA_HandleTypeDef *hdma)
{
  UNUSED(hdma);
  HAL_GPIO_WritePin(LED_YELLOW_GPIO_Port, LED_YELLOW_Pin, GPIO_PIN_SET);
  i2s_dma_buffer_half_to_fill = 1;
  // if (i2s_dma_buffer_half_to_fill != -1) {
  //   // We are late, the main loop has not yet processed the previous half
  //   HAL_GPIO_WritePin(LED_RED_GPIO_Port, LED_RED_Pin, GPIO_PIN_SET);
  //   //Error_Handler();
  // }
  // else{
  //   //Second half of buffer consumed, signal main loop to fill it
  //   i2s_dma_buffer_half_to_fill = 1;
  // }
}

void I2S_DMA_TX_ErrorCallback(DMA_HandleTypeDef *hdma)
{
  UNUSED(hdma);
  HAL_GPIO_WritePin(LED_RED_GPIO_Port, LED_RED_Pin, GPIO_PIN_SET);
  // Handle the error appropriately
  Error_Handler();
}

void I2S_DMA_RX_HalfCpltCallback(DMA_HandleTypeDef *hdma)
{
  UNUSED(hdma);
  HAL_GPIO_WritePin(LED_YELLOW_GPIO_Port, LED_YELLOW_Pin, GPIO_PIN_RESET);
}

void I2S_DMA_RX_CpltCallback(DMA_HandleTypeDef *hdma)
{
  UNUSED(hdma);
  HAL_GPIO_WritePin(LED_YELLOW_GPIO_Port, LED_YELLOW_Pin, GPIO_PIN_SET);
}

void I2S_DMA_RX_ErrorCallback(DMA_HandleTypeDef *hdma)
{
  UNUSED(hdma);
  HAL_GPIO_WritePin(LED_RED_GPIO_Port, LED_RED_Pin, GPIO_PIN_SET);
  // Handle the error appropriately
  Error_Handler();
}